# 好好学习
# 加油！加油！加油！

#赋值运算符，运算顺序是从右往左

i=3+4
print(i)
a=b=c=20    #链式赋值

print(a,id(a))
print(b,id(b))
print(c,id(c))



print('////////////////////支持参数赋值///////////////////')
a=20
a+=30
print(a)    #a=a+30
a-=10
print(a)  #a=a-10
a*=2
print(a)    #a=a*20
a/=3
print(a) #a=a/3，带有小数点
a//=2
print(a)  #a=a//2，因为带有小数，所以带个0
a%=3
print(int(a))

print('////////////////////解包赋值///////////////////')

a,b,c,d='我爱你',20,1.25,'真的爱你'
print(a,b,c,d)

print('--------------交换两个变量的值--------------------')

a,b=10,'我爱你'

print('交换之前：',a,b)

#将两个变量的赋值进行交换

a,b=b,a
print('交换之后：',a,b)

